This Nobebook file contains my notes from MySQL course that I complated at freecodecamp

### Creating Table

In [ ]:
CREATE TABLE student (
    student_id INT PRIMARY KEY,
    name VARCHAR(20),
    major VARCHAR(20)
);

DROP TABLE student;

DESCRIBE student;

ALTER TABLE student ADD gpa INT;
ALTER TABLE student MODIFY gpa DECIMAL(3, 2);

ALTER TABLE student DROP gpa;

### Inserting Values

In [ ]:
INSERT INTO student VALUES(2, 'Kate', 'Sociolagy', 1.23);

INSERT INTO student(student_id, name) VALUES(3, 'Claire');

### Constrains

In [ ]:
DROP TABLE student;

CREATE TABLE student(
    student_id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(20) UNIQUE NOT NULL,
    major VARCHAR(20) DEFAULT 'Undecided',
    gpa DECIMAL(3, 2)
);

SELECT * FROM student;

INSERT INTO student(name, major, gpa) VALUES('Jack', 'Biology', 3.42);
INSERT INTO student(name, major, gpa) VALUES('Claire', 'Sociology', 1.12);
INSERT INTO student(name, major, gpa) VALUES('Valeria', 'Sport', 1.4);
INSERT INTO student(name, major, gpa) VALUES('Mike', 'Computer Science', 3.81);
INSERT INTO student(name, major, gpa) VALUES('Ali', 'Mechanical Engineer', 3.21);
INSERT INTO student(name, major, gpa) VALUES('Jack', 'Biology', 3.42);
INSERT INTO student(name, major, gpa) VALUES('Rose', NULL, 1.21);
INSERT INTO student(name, gpa) VALUES('May', 2.1);

### Update and Delete

In [ ]:
UPDATE student
SET major = 'Bio'
WHERE major = 'Biology';

 UPDATE student 
 SET major = 'Bullshit'
 WHERE  major = 'Sociology' OR major = 'Sport';

 DELETE FROM student
 WHERE student_id = 7;

### Basic Queries

In [ ]:
SELECT name
FROM student;

SELECT student.name, student.major
From student 
ORDER BY student_id DESC; 

SELECT student.major
FROM student
LIMIT 2;

SELECT student.name, student.major
FROM student
WHERE major = 'Bullshit';

SELECT *
FROM student
WHERE name IN ('Claire', 'Jack', 'Mike');

SELECT *
FROM student
WHERE  3.5 > gpa AND gpa > 3;

### Company Database

In [ ]:
CREATE TABLE employee(
    emp_id INT PRIMARY KEY,
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    birth_date DATE,
    sex VARCHAR(1),
    salary INT,
    super_id INT,
    branch_id INT  
);

CREATE TABLE branch(
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(50),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL;

ALTER TABLE employee
ADD FOREIGN KEY(super_id)
REFERENCES employee(emp_id)
ON DELETE SET NULL;

CREATE TABLE client(
    client_id INT PRIMARY KEY,
    client_name VARCHAR(50),
    branch_id INT,
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL
);

CREATE TABLE works_with(
    emp_id INT,
    client_id INT,
    total_sales INT,
    PRIMARY KEY(emp_id, client_id),
    FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE,
    FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE
);

CREATE TABLE branch_supplier(
    branch_id INT,
    supplier_name VARCHAR(50),
    supply_type VARCHAR(50),
    PRIMARY KEY(branch_id, supplier_name),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);

-- Inserting values to tables is a little different because of foreign keys

INSERT employee VALUES(106, 'Josh', 'Porter', '1969-05-06', 'M', 78000, 101, NULL);

INSERT branch VALUES(3, 'Stamford', 106, '1998-04-06');

UPDATE employee
SET branch_id = 3
WHERE emp_id = 106;

INSERT employee VALUES(108, 'Jim', 'Halpert', '1978-04-19', 'M', 71000, 106, 3);


INSERT INTO branch_supplier VALUES(2, 'Hammer Mill', 'Paper');
INSERT INTO branch_supplier VALUES(2, 'Uni-ball', 'Writing Utensils');
INSERT INTO branch_supplier VALUES(3, 'Patriot Paper', 'Paper');
INSERT INTO branch_supplier VALUES(2, 'J.T. Forms & Labels', 'Custom Forms');
INSERT INTO branch_supplier VALUES(3, 'Uni-ball', 'Writing Utensils');
INSERT INTO branch_supplier VALUES(3, 'Hammer Mill', 'Paper');
INSERT INTO branch_supplier VALUES(3, 'Stamford Lables', 'Custom Forms');

INSERT INTO client VALUES(400, 'Dunmore Highschool', 2);
INSERT INTO client VALUES(401, 'Lackawana Country', 2);
INSERT INTO client VALUES(402, 'FedEx', 3);
INSERT INTO client VALUES(403, 'John Daly Law, LLC', 3);
INSERT INTO client VALUES(404, 'Scranton Whitepages', 2);
INSERT INTO client VALUES(405, 'Times Newspaper', 3);
INSERT INTO client VALUES(406, 'FedEx', 2);

INSERT INTO works_with VALUES(105, 400, 55000);
INSERT INTO works_with VALUES(102, 401, 267000);
INSERT INTO works_with VALUES(108, 402, 22500);
INSERT INTO works_with VALUES(107, 403, 5000);
INSERT INTO works_with VALUES(108, 403, 12000);
INSERT INTO works_with VALUES(105, 404, 33000);
INSERT INTO works_with VALUES(107, 405, 26000);
INSERT INTO works_with VALUES(102, 406, 15000);
INSERT INTO works_with VALUES(105, 406, 130000);

### More Basic Queries

In [ ]:
-- Find all employees

SELECT * FROM employee;

-- Find all employees ordered by salary

SELECT * FROM employee ORDER BY sex, employee.salary;

-- First 5 employees on the table

SELECT * FROM employee LIMIT 5;

-- Only first and last name

SELECT  first_name, last_name FROM employee;

-- Changing column name while selecting

SELECT first_name AS forename, last_name AS surname FROM employee;

-- Find out all the different genders, return all of unique values in that column.

SELECT DISTINCT sex FROM employee;

### Wildcards

In [ ]:
-- Find all LLC (Limited Liability Company) 's in clients
-- 'LIKE' is something like search method, '%' is for any number of character and
-- '_' for just one character
SELECT * FROM client WHERE client_name LIKE '%LLC';

-- Find any employee who born in October

SELECT * FROM employee WHERE birth_date LIKE '%11%';

### Unions

In [ ]:
-- Find list of all clients and branc suppliers in a single list

SELECT client_name FROM client
UNION
SELECT supplier_name FROM branch_supplier;

-- Union is basically combining results from multiple ques to single result.
-- Ofcourse there is some limitations, datatype should be simlar and result must have 
-- euqual amount of columns

-- Find all the money that company earned or spended

SELECT salary FROM employee
UNION
SELECT total_sales FROM works_with;

###Â Joins

In [ ]:
-- Find all branches and their managers 

SELECT branch.branch_id, branch.branch_name, employee.first_name 
FROM employee JOIN branch
ON branch.mgr_id = employee.emp_id;
-- Basicaly combining two different table that fits to our condition which is 'ON'

SELECT branch.branch_id, branch.branch_name, employee.first_name 
FROM employee LEFT JOIN branch
ON branch.mgr_id = employee.emp_id;
-- 'LEFT' statement getting all values from 'left' table (which is employee) to result table,
-- but getting only values that fit to our 'ON' statement from 'right' table.
-- There is also 'RIGHT' statement

### Nested Query

In [ ]:
-- Find all employees who sold move than 30K to single client

SELECT employee.emp_id, employee.first_name
FROM employee
WHERE employee.emp_id IN (
    SELECT works_with.emp_id 
    FROM works_with
    WHERE total_sales > 30000
);

-- Basicly 'WHERE' statement searhing inside the result table of second query.

-- Find all clients who handled by branch that managed by Michael Scott

SELECT works_with.emp_id, works_with.client_id, client.client_name
FROM works_with JOIN client
ON works_with.client_id = client.client_id
WHERE works_with.emp_id IN (
    SELECT employee.emp_id
    FROM  employee
    WHERE employee.super_id = 102
);

SELECT client.client_name
FROM client
WHERE client.branch_id = (
    SELECT branch.branch_id
    FROM branch
    WHERE branch.mgr_id = 102
    LIMIT 1 -- We are using '=' instead 'IN' because of that we have to be sure there is one value
            -- Just in case Michael Sctoo managing more than 1 branch
);

### Functions

In [ ]:
-- Find the number or all employees

SELECT COUNT(emp_id) FROM employee;

-- Find how many Fenale employees that born after 1970

SELECT COUNT(emp_id) FROM employee WHERE sex = 'F' AND birth_date > '1970-01-01';

-- Find average salary of employees

SELECT AVG(salary) FROM employee;
-- Employees who make less than 100k
SELECT AVG(salary) FROM employee WHERE salary < 100000;

-- Find total salary expences of company

SELECT SUM(salary) FROM employee;

-- Find how many males and females there are

SELECT COUNT(sex), sex FROM employee GROUP BY sex;

-- Find total sales of each salesman made

SELECT emp_id, SUM(total_sales) FROM works_with GROUP BY emp_id;

### On Delete

In [ ]:
-- ON DELETE statements used for foreign keys in case of value that assocuated with that foreign key deleted
-- SET NULL is setting that foreign key value to NULL
-- CASCADE is deleting the rows that include that foreign key from table, this is used when the foreign key is used as/part of primary key.

CREATE TABLE branch(
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(50),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

CREATE TABLE works_with(
    emp_id INT,
    client_id INT,
    total_sales INT,
    PRIMARY KEY(emp_id, client_id),
    FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE,
    FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE
);